from turtle import *
title('महाकाल')
bgcolor('black')
pencolor('orange')
speed(50)
mahakal=["जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल",
"जय श्री महाकाल","जय श्री महाकाल","जय श्री महाकाल"]
angle=360/50
sety(-1)
hideturtle()
for i in range(2):
    penup()
    for i in range(50):
        left(angle)
        forward(260)
        write(mahakal[i],align='right',font=('Arial',12,'bold'))
        backward(260)
    penup()
    goto(-40,-20)
    pendown()
penup()
goto(-40,-20)
pendown()
write(" || महाकाल || ",font=('Arial',60,'bold'),align='center')
done()